
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13077427009)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.k8s_nodes__prod.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.k8s_nodes__prod.proxmox_vm_qemu.gateway
  * module.k8s_nodes__prod.proxmox_vm_qemu.worker[&#34;1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.k8s_nodes__prod.proxmox_vm_qemu.control_plane["1"] will be created
  + resource "proxmox_vm_qemu" "control_plane" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = true
      + ciuser                 = "machine-user"
      + clone                  = "alma-9"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.11/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 3072
      + name                   = "prod-k8s-cp-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEC6sFg741zloMPUOpnXmmStdVUhy/9ousPBJ6I6nX33 machine-user@lucky-proxmox-01
        EOT
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;control_plane"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 811

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.k8s_nodes__prod.proxmox_vm_qemu.gateway will be created
  + resource "proxmox_vm_qemu" "gateway" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = true
      + ciuser                 = "machine-user"
      + clone                  = "alma-9"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.20.5/24,gw=192.168.20.1"
      + ipconfig1              = "ip=192.168.8.2/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "prod-k8s-gw-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEC6sFg741zloMPUOpnXmmStdVUhy/9ousPBJ6I6nX33 machine-user@lucky-proxmox-01
        EOT
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;gateway"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 801

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.k8s_nodes__prod.proxmox_vm_qemu.worker["1"] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = true
      + ciuser                 = "machine-user"
      + clone                  = "alma-9"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.21/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 6144
      + name                   = "prod-k8s-wk-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEC6sFg741zloMPUOpnXmmStdVUhy/9ousPBJ6I6nX33 machine-user@lucky-proxmox-01
        EOT
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;worker"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 821

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":54,"Program":"tfcmt","SHA1":"f63abbb9bae0c7166ecfc2d5b1e9f168fd76490b","Vars":{},"WorkflowName":"Terraform CI"} -->